In [3]:
import pandas as pd 
import duckdb as db
import json

import sys
import os
# Adiciona o caminho até a pasta que contém o configs.py
sys.path.append(os.path.abspath('../..'))

#chamando a função do módulo configs.py que mapeia as pastas no ambiente
import configs as cf
cf.mapeia_pastas()

In [5]:
con = cf.criar_conexao_db()

In [6]:
# Função que recebe o nome de uma query e retorna o conteúdo do arquivo .sql correspondente
def ler_query(query_name):
    # Abre o arquivo .sql com o nome especificado em 'query_name' na pasta 'database'
    with open(f'../database/{query_name}.sql', "r", encoding="utf-8") as file:
        sql_text = file.read() # Lê o conteúdo do arquivo
        return sql_text  # Retorna o conteúdo do arquivo (a query SQL)

In [7]:
profissoes = ler_query("ETL_tabelas")

In [8]:
con.execute(profissoes)

In [9]:
#função recursiva
def carregar_tabela_etl(nome_tabela):
    return con.execute(f"SELECT * FROM {nome_tabela}").df()

tbl_estados_brasil = carregar_tabela_etl("tbl_estados_brasil")
tbl_advogados_brasil_2024 = carregar_tabela_etl("tbl_advogados_brasil_2024")
tbl_contadores_brasil_2024 = carregar_tabela_etl("tbl_contadores_brasil_2024")
tbl_engenheiros_brasil_2024 = carregar_tabela_etl("tbl_engenheiros_brasil_2024")
tbl_psicologos_brasil_2024 = carregar_tabela_etl("tbl_psicologos_brasil_2024")

In [10]:
tbl_estados_brasil

Empty DataFrame
Columns: [id, uf, nome_estado]
Index: []

In [11]:
tbl_advogados_brasil_2024

Empty DataFrame
Columns: [estado, feminino, masculino]
Index: []

In [12]:
tbl_contadores_brasil_2024

Empty DataFrame
Columns: [estado, feminino, masculino]
Index: []

In [13]:
tbl_engenheiros_brasil_2024

Empty DataFrame
Columns: [estado, feminino, masculino]
Index: []

In [14]:
tbl_psicologos_brasil_2024

Empty DataFrame
Columns: [estado, feminino, masculino]
Index: []

In [15]:
values_estados_json = '../utils/utils.json'

In [16]:
with open(values_estados_json, encoding='utf-8') as values:
    json_dados = json.load(values)

In [17]:
json_dados['tbl_estados_brasil']

[{'id': 1, 'uf': 'AC', 'nome_estado': 'Acre'},
 {'id': 2, 'uf': 'AL', 'nome_estado': 'Alagoas'},
 {'id': 4, 'uf': 'AM', 'nome_estado': 'Amazonas'},
 {'id': 5, 'uf': 'AP', 'nome_estado': 'Amapá'},
 {'id': 6, 'uf': 'BA', 'nome_estado': 'Bahia'},
 {'id': 7, 'uf': 'CE', 'nome_estado': 'Ceará'},
 {'id': 8, 'uf': 'DF', 'nome_estado': 'Distrito Federal'},
 {'id': 9, 'uf': 'ES', 'nome_estado': 'Espírito Santo'},
 {'id': 10, 'uf': 'GO', 'nome_estado': 'Goiás'},
 {'id': 11, 'uf': 'MA', 'nome_estado': 'Maranhão'},
 {'id': 12, 'uf': 'MG', 'nome_estado': 'Minas Gerais'},
 {'id': 13, 'uf': 'MS', 'nome_estado': 'Mato Grosso do Sul'},
 {'id': 14, 'uf': 'MT', 'nome_estado': 'Mato Grosso'},
 {'id': 15, 'uf': 'PA', 'nome_estado': 'Pará'},
 {'id': 16, 'uf': 'PB', 'nome_estado': 'Paraíba'},
 {'id': 17, 'uf': 'PE', 'nome_estado': 'Pernambuco'},
 {'id': 18, 'uf': 'PI', 'nome_estado': 'Piauí'},
 {'id': 19, 'uf': 'PR', 'nome_estado': 'Paraná'},
 {'id': 20, 'uf': 'RJ', 'nome_estado': 'Rio de Janeiro'},
 {'id': 21, 'uf': 'RN', 'nome_estado': 'Rio Grande do Norte'},
 {'id': 22, 'uf': 'RO', 'nome_estado': 'Rondônia'},
 {'id': 23, 'uf': 'RR', 'nome_estado': 'Roraima'},
 {'id': 24, 'uf': 'RS', 'nome_estado': 'Rio Grande do Sul'},
 {'id': 25, 'uf': 'SC', 'nome_estado': 'Santa Catarina'},
 {'id': 26, 'uf': 'SE', 'nome_estado': 'Sergipe'},
 {'id': 27, 'uf': 'SP', 'nome_estado': 'São Paulo'},
 {'id': 28, 'uf': 'TO', 'nome_estado': 'Tocantins'}]

In [18]:
df_tabela_estados = pd.DataFrame(json_dados['tbl_estados_brasil'])
df_tabela_estados

    id  uf          nome_estado
0    1  AC                 Acre
1    2  AL              Alagoas
2    4  AM             Amazonas
3    5  AP                Amapá
4    6  BA                Bahia
5    7  CE                Ceará
6    8  DF     Distrito Federal
7    9  ES       Espírito Santo
8   10  GO                Goiás
9   11  MA             Maranhão
10  12  MG         Minas Gerais
11  13  MS   Mato Grosso do Sul
12  14  MT          Mato Grosso
13  15  PA                 Pará
14  16  PB              Paraíba
15  17  PE           Pernambuco
16  18  PI                Piauí
17  19  PR               Paraná
18  20  RJ       Rio de Janeiro
19  21  RN  Rio Grande do Norte
20  22  RO             Rondônia
21  23  RR              Roraima
22  24  RS    Rio Grande do Sul
23  25  SC       Santa Catarina
24  26  SE              Sergipe
25  27  SP            São Paulo
26  28  TO            Tocantins

In [19]:
arquivos = ["catalogo_de_dados.xlsx", "tbl_advogados_brasil_2024.xlsx", 
            "tbl_contadores_brasil_2024.xlsx", "tbl_engenheiros_brasil_2024.xlsx", 
            "tbl_psicologos_brasil_2024.xlsx"]

# Lendo os arquivos e armazenando em um dicionário
tabela = {nome: pd.read_excel(f"../origens/{nome}") for nome in arquivos}

In [20]:
# Função para acessar as tabelas no dicionário
def carregar_tabela(nome_tabela):
    # Retorna o DataFrame correspondente ao nome da tabela, se existir
    return tabela.get(nome_tabela)

In [21]:
df_catalago = carregar_tabela("catalogo_de_dados.xlsx")
df_advogados = carregar_tabela("tbl_advogados_brasil_2024.xlsx")
df_contadores = carregar_tabela("tbl_contadores_brasil_2024.xlsx")
df_engenheiros = carregar_tabela("tbl_engenheiros_brasil_2024.xlsx")
df_psicologos = carregar_tabela("tbl_psicologos_brasil_2024.xlsx")

In [22]:
df_catalago

,Tabela,Coluna,Tipo do Dado,Descritivo do Campo
0,tbl_advogados_brasil_2024,Estado,VARCHAR (50),Campo que registra os estados do Brasil dentro...
1,tbl_advogados_brasil_2024,Feminino,INT,Campo que registra a quantidade de pessoas do ...
2,tbl_advogados_brasil_2024,Masculino,INT,Campo que registra a quantidade de pessoas do ...
3,tbl_contadores_brasil_2024,Estado,VARCHAR (50),Campo que registra os estados do Brasil dentro...
4,tbl_contadores_brasil_2024,Masculino,INT,Campo que registra a quantidade de pessoas do ...
5,tbl_contadores_brasil_2024,Feminino,INT,Campo que registra a quantidade de pessoas do ...
6,tbl_engenheiros_brasil_2024,Estado,VARCHAR (50),Campo que registra os estados do Brasil dentro...
7,tbl_engenheiros_brasil_2024,Feminino,INT,Campo que registra a quantidade de pessoas do ...
8,tbl_engenheiros_brasil_2024,Masculino,INT,Campo que registra a quantidade de pessoas do ...
9,tbl_psicologos_brasil_2024,Estado,VARCHAR (50),Campo que registra os estados do Brasil dentro...
10,tbl_psicologos_brasil_2024,Feminino,INT,Campo que registra a quantidade de pessoas do ...
11,tbl_psicologos_brasil_2024,Masculino,INT,Campo que registra a quantidade de pessoas do ...

In [23]:
df_advogados

   Estado  Feminino  Masculino
0      AC      1898       2078
1      AL      7376       7847
2      AM      8181       7544
3      AP      2124       2049
4      BA     33281      28654
5      CE     19541      20292
6      DF     26508      25358
7      ES     14451      13009
8      GO     28562      25229
9      MA     12026      12020
10     MG     74205      69942
11     MS      9500       9505
12     MT     13516      12059
13     PA     15124      13056
14     PB     10665      11491
15     PE     22227      21046
16     PI      8684       9517
17     PR     47022      44869
18     RJ     84602      74423
19     RN      8106       8413
20     RO      5818       5102
21     RR      1473       1398
22     RS     51660      47028
23     SC     27023      25110
24     SE      6955       6370
25     SP    197236     181116
26     TO      4966       4592

In [24]:
df_contadores

   Estado  Masculino  Feminino
0      DF       6407      4512
1      GO       6276      4137
2      MS       2886      2637
3      MT       4241      4037
4      AL       1832      1433
5      BA       9497      7314
6      CE       5587      4375
7      MA       3425      2475
8      PB       2811      2247
9      PE       5904      5094
10     PI       2809      2233
11     RN       3006      2761
12     SE       1469      1313
13     AC        539       512
14     AM       2532      3106
15     AP        743       660
16     PA       5178      5728
17     RO       1882      1719
18     RR        501       551
19     TO       1580      1277
20     ES       4174      4174
21     MG      17903     18568
22     RJ      20288     17855
23     SP      56528     49302
24     PR      15933     12027
25     RS      12378     13618
26     SC       9728      9328

In [25]:
df_engenheiros

     Estado  Feminino  Masculino
0   CREA-AC       710       1892
1   CREA-AL      1677       7159
2   CREA-AM      4236      11833
3   CREA-AP       391       1278
4   CREA-BA     12202      39436
5   CREA-CE      4673      19166
6   CREA-DF      4602      18081
7   CREA-ES      6004      17778
8   CREA-GO      8487      28991
9   CREA-MA      3821      12044
10  CREA-MG     32656     121679
11  CREA-MS      3793      13313
12  CREA-MT      6962      20483
13  CREA-PA      9615      24308
14  CREA-PB      2848      10438
15  CREA-PE      5646      20929
16  CREA-PI      1935       7985
17  CREA-PR     13595      58273
18  CREA-RJ     23618      93569
19  CREA-RN      3361      11362
20  CREA-RO      2123       5258
21  CREA-RR       544       1119
22  CREA-RS     14061      54101
23  CREA-SC     10400      37472
24  CREA-SE      1888       5614
25  CREA-SP     53124     281812
26  CREA-TO      1799       5200

In [26]:
df_psicologos

                 Estado  Feminino  Masculino
0                  Acre      1181        236
1               Alagoas      5399        991
2                 Amapá      1201        261
3              Amazonas      5163        996
4                 Bahia     21113       3559
5                 Ceará     12387       2508
6      Distrito Federal     13246       2407
7        Espírito Santo      7601       1499
8                 Goiás     13638       1966
9              Maranhão      5475       1028
10          Mato Grosso      6371        939
11   Mato Grosso do Sul      5204        789
12         Minas Gerais     48465       9033
13                 Pará      6055       1206
14              Paraíba      6869       1323
15               Paraná     27062       4695
16           Pernambuco     17090       2930
17                Piauí      4005        714
18       Rio de Janeiro     50682       8476
19  Rio Grande do Norte      5605       1186
20    Rio Grande do Sul     27680       4001
21             Rondônia      2743        516
22              Roraima       971        167
23       Santa Catarina     17963       2739
24            São Paulo    132077      22613
25              Sergipe      3372        723
26            Tocantins      2244        373

In [27]:
arquivos = {
    "tbl_advogados_brasil_2024": df_advogados,
    "tbl_contadores_brasil_2024": df_contadores,
    "tbl_engenheiros_brasil_2024": df_engenheiros,
    "tbl_psicologos_brasil_2024": df_psicologos,
    "tbl_estados_brasil": df_tabela_estados
}

for nome in arquivos:
    con.register("temp", arquivos[nome])
    con.execute(f"INSERT INTO {nome} SELECT * FROM temp")
    con.unregister("temp")

In [28]:
tbl_advogados_brasil_2024 = con.execute("SELECT * FROM tbl_advogados_brasil_2024").df()
tbl_advogados_brasil_2024.head()

  estado  feminino  masculino
0     AC      1898       2078
1     AL      7376       7847
2     AM      8181       7544
3     AP      2124       2049
4     BA     33281      28654

In [29]:
tbl_estados_brasil = con.execute("SELECT * FROM tbl_estados_brasil").df()
tbl_estados_brasil.head()

   id  uf nome_estado
0   1  AC        Acre
1   2  AL     Alagoas
2   4  AM    Amazonas
3   5  AP       Amapá
4   6  BA       Bahia

In [30]:
tbl_contadores_brasil_2024 = con.execute("SELECT * FROM tbl_contadores_brasil_2024").df()
tbl_contadores_brasil_2024.head()

  estado  feminino  masculino
0     DF      6407       4512
1     GO      6276       4137
2     MS      2886       2637
3     MT      4241       4037
4     AL      1832       1433

In [31]:
tbl_engenheiros_brasil_2024 = con.execute("SELECT * FROM tbl_engenheiros_brasil_2024").df()
tbl_engenheiros_brasil_2024.head()

    estado  feminino  masculino
0  CREA-AC       710       1892
1  CREA-AL      1677       7159
2  CREA-AM      4236      11833
3  CREA-AP       391       1278
4  CREA-BA     12202      39436

In [32]:
tbl_psicologos_brasil_2024 = con.execute("SELECT * FROM tbl_psicologos_brasil_2024").df()
tbl_psicologos_brasil_2024.head()

     estado  feminino  masculino
0      Acre      1181        236
1   Alagoas      5399        991
2     Amapá      1201        261
3  Amazonas      5163        996
4     Bahia     21113       3559

In [33]:
con.close()